import { useMatch } from "react-router-dom";

function SearchContent(props) {
  return (
    props.isFocusing ? (
      <p>“派蒙去采蘑菇了。”一把熟悉的清甜声线，我抬起头，诗人倚靠在一尊石像旁，披风与长发，都在空中飞扬。他拨弄着一首曲子，几只淡蓝色的蝴蝶围绕着他飞舞，“她在山腰发现了一口炊锅，待会儿也许会带着午饭上来找我们吧。”<br/>
      我紧张起来，爬出睡袋。身体应该是被清理过，除了有点腿软外并没有大碍，我走到石边抓起晾干的衣物往身上套，“这里会不会有魔物什么的？我最好还是去看着她。”<br/>
      “别担心啦旅行者，”温迪摇摇手，“我在她身边有设下一个小法阵……如果遇到危险，会自动触发两次风神之诗……我想这足够她跑回来了。”<br/>
      “而我也要走啦。今天的东风很好，有新柳的味道，我想我会去轻策庄，带点霓裳花回到蒙德试着培育。”他展开双手。<br/>
      我一时说不出话。<br/>
      我跟温迪的关系似乎一直都是这样若即若离，我并不擅长打理我跟许多人之间保持着的连接，于是总会故意规避在跟某一个人待在一起时，撞见另外一个……而温迪正如他身边流转着的青绿元素那样来去自由，有时我跟迪卢克在一起时，会远远看到他坐在葡萄架上吹奏叶笛，间或着抬起头，冲我微笑。我不知道在他心目中我算什么，当然，我也不会去问。<br/>
      我们合该止步于此。彼此恪守界限，永不逾矩。<br/>
      “……你会去哪里？”我还是没忍住问道，他想了想，“我希望会是望舒客栈，或者璃月城内的酒楼，前者有璃月最好的佳酿，后者有海上生明月。”温迪侧过头来，他的视线苍翠明亮，“我想我会愿意在秋月最满的那日落到你的窗台上，然后运风带你去白色沙滩上看星星。”<br/>
      “那我记下了。”我笑了笑。<br/>
      “夜雨凉秋色，思君在边陲。”他轻轻哼着这句诗。<br/>
      我们在原地沉默了一会儿，直到派蒙带着几串烤肉回来分着吃了后，他才一甩披风，大踏步地走向悬崖。派蒙尖叫的声音被风扯碎，我看到温迪的身影在消失在云影里的前夕，回过头来，将食指按在唇上，随后朝我一飞。我微微抬起头，向后退了一步，于是那缕从他指尖迸出的风，就这样落到了我的眉心，轻柔的，比白雪更轻柔。<br/>
      ……仿佛一个欲语还休的吻。</p>
    ) : (
      <p>
      ― 奏<br/>
      <br/>
      名前を呼ばれた気がした。<br/>
      聞きたかった声だ。<br/>
      だからわたしも名前を呼ぶ。<br/>
      熱くて、苦しかったのに、なんだかひんやりとした感じがして、ほぅ……と息を吐き出した。<br/>
      <br/>
      ― 私はここだよ、奏<br/>
      <br/>
      どこ？<br/>
      どこにいるの？<br/>
      夢だから見えない。<br/>
      何かが離れていく感じがして怖くて目を開けば、宵紫が少し揺れていた。<br/>
      <br/>
      「まふ……ゆ？」<br/>
      「ただいま、奏」<br/>
      「おか、えり……あぁ、まふゆだ」<br/>
      <br/>
      会いたかった子だ。<br/>
      夢なら、いいかな。<br/>
      少しだけ本当のことを言ってもいいかな。<br/>
      少しだけ、触れてもいいかな。<br/>
      手を伸ばせば夢の中のまふゆが握り返してくれたから、笑みが溢れる。<br/>
      <br/>
      「ひとりはなれてるとおもったんだけどなぁ……」<br/>
      「うん」<br/>
      「まふゆがいなくて、さびしかった」<br/>
      「……っ」<br/>
      「さびしかったよ、まふゆ」 <br/>
      <br/>
      <br/>
      夢の中だから言える。<br/>
      起きたらちゃんといつも通りに振る舞うから。<br/>
      大人になるから。<br/>
      子供のまふゆを守る大人に、なるから。<br/>
      <br/>
      目を閉じて、ゆっくりと沈んでいく意識の中<br/>
      唇に何か柔らかいものが触れたような気がした。<br/>
      <br/>
      「―――」<br/>
      <br/>
      声が聞こえた。<br/>
      だけど、その言葉をきちんと聞き取ることはできなかった。
      </p>
    )
  );
}

export default SearchContent;